In [1]:
import numpy as np
import pandas as pd

In [2]:
# series

In [3]:
dictionary = {"key1":50,"key2":30,"key3":20}

In [4]:
pd.Series(dictionary)

key1    50
key2    30
key3    20
dtype: int64

In [5]:
myList = np.array([10,20,30])

In [6]:
myList2 = np.array(["key1","key2","key3"])

In [7]:
pd.Series(myList,myList2)

key1    10
key2    20
key3    30
dtype: int32

In [8]:
pd.Series(data = myList,index = myList2)

key1    10
key2    20
key3    30
dtype: int32

In [9]:
yarisma1 = pd.Series([10,20,30],["a","b","c"])

In [10]:
yarisma2 = pd.Series([3,5,7],["a","b","c"])

In [11]:
yarisma1

a    10
b    20
c    30
dtype: int64

In [12]:
yarisma2

a    3
b    5
c    7
dtype: int64

In [13]:
sonuc = yarisma1 + yarisma2

In [14]:
sonuc

a    13
b    25
c    37
dtype: int64

In [15]:
myList1 = pd.Series(np.linspace(0,20,2),["a","f"])

In [16]:
myList1

a     0.0
f    20.0
dtype: float64

In [17]:
myList2 = pd.Series(np.arange(3,6),["a","g","d"])

In [18]:
myList1 + myList2

a    3.0
d    NaN
f    NaN
g    NaN
dtype: float64

## Dataframes

In [19]:
import numpy as np
import pandas as pd

In [20]:
data = np.random.randn(4,4)

In [21]:
data

array([[-2.16144953, -0.9815679 , -0.20015127, -0.25605557],
       [-0.04437622, -0.80567322,  0.33015753,  0.86236622],
       [-0.1662799 ,  0.09437929,  1.03274208, -0.03106423],
       [-1.38151568, -0.37897091, -0.96300346,  0.67894488]])

In [22]:
df = pd.DataFrame(data)

In [23]:
df

          0         1         2         3
0 -2.161450 -0.981568 -0.200151 -0.256056
1 -0.044376 -0.805673  0.330158  0.862366
2 -0.166280  0.094379  1.032742 -0.031064
3 -1.381516 -0.378971 -0.963003  0.678945

In [24]:
df[0]

0   -2.161450
1   -0.044376
2   -0.166280
3   -1.381516
Name: 0, dtype: float64

In [25]:
newDf = pd.DataFrame(data,index = ["Ali","Beyaz","Ceyhun","Derya"],columns = ["Maas","Yas","CalismaSaati","Para"])
newDf

            Maas       Yas  CalismaSaati      Para
Ali    -2.161450 -0.981568     -0.200151 -0.256056
Beyaz  -0.044376 -0.805673      0.330158  0.862366
Ceyhun -0.166280  0.094379      1.032742 -0.031064
Derya  -1.381516 -0.378971     -0.963003  0.678945

In [26]:
newDf["Yas"]

Ali      -0.981568
Beyaz    -0.805673
Ceyhun    0.094379
Derya    -0.378971
Name: Yas, dtype: float64

In [27]:
newDf.loc["Derya"]

Maas           -1.381516
Yas            -0.378971
CalismaSaati   -0.963003
Para            0.678945
Name: Derya, dtype: float64

In [28]:
newDf.iloc[3]

Maas           -1.381516
Yas            -0.378971
CalismaSaati   -0.963003
Para            0.678945
Name: Derya, dtype: float64

In [29]:
newDf

            Maas       Yas  CalismaSaati      Para
Ali    -2.161450 -0.981568     -0.200151 -0.256056
Beyaz  -0.044376 -0.805673      0.330158  0.862366
Ceyhun -0.166280  0.094379      1.032742 -0.031064
Derya  -1.381516 -0.378971     -0.963003  0.678945

In [30]:
newDf["Emeklilik Yasi"] = newDf["Yas"] + newDf["Yas"]

In [31]:
newDf

            Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
Ali    -2.161450 -0.981568     -0.200151 -0.256056       -1.963136
Beyaz  -0.044376 -0.805673      0.330158  0.862366       -1.611346
Ceyhun -0.166280  0.094379      1.032742 -0.031064        0.188759
Derya  -1.381516 -0.378971     -0.963003  0.678945       -0.757942

In [34]:
newDf.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  CalismaSaati      Para
Ali    -2.161450 -0.981568     -0.200151 -0.256056
Beyaz  -0.044376 -0.805673      0.330158  0.862366
Ceyhun -0.166280  0.094379      1.032742 -0.031064
Derya  -1.381516 -0.378971     -0.963003  0.678945

In [35]:
newDf.drop("Ali")

            Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
Beyaz  -0.044376 -0.805673      0.330158  0.862366       -1.611346
Ceyhun -0.166280  0.094379      1.032742 -0.031064        0.188759
Derya  -1.381516 -0.378971     -0.963003  0.678945       -0.757942

In [36]:
newDf.drop("Ali",inplace=True)

In [37]:
newDf

            Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
Beyaz  -0.044376 -0.805673      0.330158  0.862366       -1.611346
Ceyhun -0.166280  0.094379      1.032742 -0.031064        0.188759
Derya  -1.381516 -0.378971     -0.963003  0.678945       -0.757942

In [38]:
newDf[newDf["Yas"] > 0]

           Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
Ceyhun -0.16628  0.094379      1.032742 -0.031064        0.188759

In [40]:
newDf.reset_index(inplace=True)

In [41]:
newDf

    index      Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
0   Beyaz -0.044376 -0.805673      0.330158  0.862366       -1.611346
1  Ceyhun -0.166280  0.094379      1.032742 -0.031064        0.188759
2   Derya -1.381516 -0.378971     -0.963003  0.678945       -0.757942

In [42]:
newDf["Indexes"] = ["a","b","c"]

In [45]:
newDf.set_index("Indexes",inplace=True)

In [46]:
newDf

          index      Maas       Yas  CalismaSaati      Para  Emeklilik Yasi
Indexes
a         Beyaz -0.044376 -0.805673      0.330158  0.862366       -1.611346
b        Ceyhun -0.166280  0.094379      1.032742 -0.031064        0.188759
c         Derya -1.381516 -0.378971     -0.963003  0.678945       -0.757942

In [48]:
newDf.loc["a"]

index                Beyaz
Maas             -0.044376
Yas              -0.805673
CalismaSaati      0.330158
Para              0.862366
Emeklilik Yasi   -1.611346
Name: a, dtype: object

In [50]:
firstIndexes = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [51]:
secondIndexes = ["a","b","c","d","e","f"]

In [52]:
myList = list(zip(firstIndexes,secondIndexes))

In [53]:
df = pd.MultiIndex.from_tuples(myList)

In [54]:
df

MultiIndex([(   'Simpson', 'a'),
            (   'Simpson', 'b'),
            (   'Simpson', 'c'),
            ('South Park', 'd'),
            ('South Park', 'e'),
            ('South Park', 'f')],
           )

In [55]:
myCartoon = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[13,"E"],[46,"F"]]

In [56]:
myCartoon

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [13, 'E'], [46, 'F']]

In [57]:
Cartoons = np.array(myCartoon)

In [58]:
Cartoons

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['13', 'E'],
       ['46', 'F']], dtype='<U11')

In [59]:
df = pd.DataFrame(Cartoons,index=df,columns = ["Yas","Meslek"])

In [60]:
df

             Yas Meslek
Simpson    a  40      A
           b  10      B
           c  30      C
South Park d   9      D
           e  13      E
           f  46      F

In [61]:
df.loc["Simpson"]

  Yas Meslek
a  40      A
b  10      B
c  30      C

In [62]:
df.loc["South Park"]

  Yas Meslek
d   9      D
e  13      E
f  46      F

In [63]:
df.index.names = ["Cartoons","Name"]

In [64]:
df

                Yas Meslek
Cartoons   Name
Simpson    a     40      A
           b     10      B
           c     30      C
South Park d      9      D
           e     13      E
           f     46      F